AccumulationRegisters/УчетНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>УчетНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ВыполнениеОперацийНаСервере/Ext/Module.bsl
// Выполняет проведение документов указанного вида на сервере 1С:Предприятия 
//
Процедура ПровестиДокументыНаСервере(ИмяДокумента) Экспорт
	
	Сообщить("Проведение документов " + ИмяДокумента + " --------------------");
	//Выберем все документы указаннго вида
	ВыборкаДокументов = Документы[ИмяДокумента].Выбрать();
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если ВыборкаДокументов.Проведен Тогда
		
			Сообщить("Проведение документа: " + ВыборкаДокументов);
			//Проводим документ
			ДокументОбъект = ВыборкаДокументов.ПолучитьОбъект();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		КонецЕсли;
		
	КонецЦикла
	 
КонецПроцедуры	

// Выполняет формирование движений приходной накладной на сервере 1С:Предприятия 
//
Процедура СформироватьДвиженияПриходнойНакладной(ДокументСсылка) Экспорт
	
		//Прочитаем данные документа
	    Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПриходнаяНакладнаяСостав.Ссылка.Склад,
		               |	ПриходнаяНакладнаяСостав.Номенклатура,
		               |	ПриходнаяНакладнаяСостав.Количество,
		               |	ПриходнаяНакладнаяСостав.Ссылка.Дата
		               |ИЗ
		               |	Документ.ПриходнаяНакладная.Состав КАК ПриходнаяНакладнаяСостав
		               |
		               |ГДЕ
		               |	ПриходнаяНакладнаяСостав.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		НаборЗаписей = РегистрыНакопления.УчетНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
		
		//Выполним формирование движений
		Пока Выборка.Следующий() Цикл
			Движение = НаборЗаписей.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Выборка.Дата;
			Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Выборка.Склад;
			Движение.Количество = Выборка.Количество;
		КонецЦикла;
		
		НаборЗаписей.Записать();
	 
	КонецПроцедуры
